{
  "description": "Use this template to protect sign-ins to admin portals if you are unable to use the \"Require MFA for admins\" template.",
  "details": {
    "sessionControls": null,
    "grantControls": {
      "termsOfUse": [],
      "operator": "OR",
      "builtInControls": [],
      "authenticationStrength": {
        "policyType": "builtIn",
        "id": "00000000-0000-0000-0000-000000000002",
        "createdDateTime": "2021-12-01T08:00:00Z",
        "description": "Combinations of methods that satisfy strong authentication, such as a password + SMS",
        "combinationConfigurations@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/templates('6364131e-bc4a-47c4-a20b-33492d1fff6c')/details/grantControls/authenticationStrength/combinationConfigurations",
        "combinationConfigurations": [],
        "displayName": "Multifactor authentication",
        "allowedCombinations": [
          "windowsHelloForBusiness",
          "fido2",
          "x509CertificateMultiFactor",
          "deviceBasedPush",
          "temporaryAccessPassOneTime",
          "temporaryAccessPassMultiUse",
          "password,microsoftAuthenticatorPush",
          "password,softwareOath",
          "password,hardwareOath",
          "password,sms",
          "password,voice",
          "federatedMultiFactor",
          "microsoftAuthenticatorPush,federatedSingleFactor",
          "softwareOath,federatedSingleFactor",
          "hardwareOath,federatedSingleFactor",
          "sms,federatedSingleFactor",
          "voice,federatedSingleFactor"
        ],
        "modifiedDateTime": "2021-12-01T08:00:00Z",
        "requirementsSatisfied": "mfa"
      },
      "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/templates('6364131e-bc4a-47c4-a20b-33492d1fff6c')/details/grantControls/authenticationStrength/$entity",
      "customAuthenticationFactors": []
    },
    "conditions": {
      "authenticationFlows": null,
      "clientAppTypes": [
        "all"
      ],
      "devices": null,
      "clientApplications": null,
      "times": null,
      "insiderRiskLevels": null,
      "signInRiskLevels": [],
      "users": {
        "excludeGroups": [],
        "includeUsers": [],
        "includeGuestsOrExternalUsers": null,
        "excludeGuestsOrExternalUsers": null,
        "excludeRoles": [],
        "excludeUsers": [
          "Current administrator will be excluded"
        ],
        "includeGroups": [],
        "includeRoles": [
          "62e90394-69f5-4237-9190-012177145e10",
          "194ae4cb-b126-40b2-bd5b-6091b380977d",
          "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
          "29232cdf-9323-42fd-ade2-1d097af3e4de",
          "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
          "729827e3-9c14-49f7-bb1b-9608f156bbb8",
          "b0f54661-2d74-4c50-afa3-1ec803f12efe",
          "fe930be7-5e62-47db-91af-98c3a49a38b1",
          "c4e39bd9-1100-46d3-8c65-fb160da0071f",
          "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
          "158c047a-c907-4556-b7ef-446551a6b5f7",
          "966707d0-3269-4727-9be2-8c3a10f19b9d",
          "7be44c8a-adaf-4e2a-84d6-ab2649e08a13",
          "e8611ab8-c189-46e8-94e1-60213ab1f814"
        ]
      },
      "locations": null,
      "applications": {
        "applicationFilter": null,
        "includeUserActions": [],
        "globalSecureAccess": null,
        "networkAccess": null,
        "excludeApplications": [],
        "includeApplications": [
          "MicrosoftAdminPortals"
        ],
        "includeAuthenticationContextClassReferences": []
      },
      "platforms": null,
      "deviceStates": null,
      "clients": null,
      "userRiskLevels": [],
      "servicePrincipalRiskLevels": []
    }
  },
  "name": "Require multifactor authentication for Microsoft admin portals",
  "id": "6364131e-bc4a-47c4-a20b-33492d1fff6c",
  "scenarios": "zeroTrust,protectAdmins"
}
